In [2]:
import sqlite3
import pandas as pd

In [4]:
conDB = sqlite3.connect("my_database.db")
conSqlite = sqlite3.connect("my_database.sqlite")

# Creating test table in my_database.db

In [34]:
conDB.execute("drop table if exists test")
query = "create table test(A varchar(20), B varchar(20), C real, D integer)"
conDB.execute(query)
conDB.commit()

In [35]:
# Inserting single data using execute()
conDB.execute("insert into test values('Mumbai', 'Maharastra', 1.25, 4)")
conDB.execute("insert into test values('Surat', 'Gujarat', 3.67, 5)")
conDB.commit()

In [36]:
# Insertin multiple data using executemany()
data = [('Jaipur', 'Rajasthan', 4.25, 6),
       ('Kanpur', 'UP', 3.97, 7),
       ('Bhopal', 'MP', 4.76, 3)]
query = "insert into test values(?, ?, ?, ?)"
conDB.executemany(query, data)
conDB.commit()

In [37]:
# Displaying data in normal form
cur = conDB.execute("select *from test")
rows = cur.fetchall()
rows

[(u'Mumbai', u'Maharastra', 1.25, 4),
 (u'Surat', u'Gujarat', 3.67, 5),
 (u'Jaipur', u'Rajasthan', 4.25, 6),
 (u'Kanpur', u'UP', 3.97, 7),
 (u'Bhopal', u'MP', 4.76, 3)]

In [38]:
# Displaying data in Tablular format using pd.DataFrame()
pd.DataFrame(rows, columns=[x[0] for x in cur.description])

        A           B     C  D
0  Mumbai  Maharastra  1.25  4
1   Surat     Gujarat  3.67  5
2  Jaipur   Rajasthan  4.25  6
3  Kanpur          UP  3.97  7
4  Bhopal          MP  4.76  3

In [50]:
result = conDB.execute("select *from test order by D")
rows = result.fetchall()
pd.DataFrame(rows, columns=[i[0] for i in result.description])

        A           B     C  D
0  Bhopal          MP  4.76  3
1  Mumbai  Maharastra  1.25  4
2   Surat     Gujarat  3.67  5
3  Jaipur   Rajasthan  4.25  6
4  Kanpur          UP  3.97  7

In [54]:
result = conDB.execute("select *from test order by D desc")
rows = result.fetchall()
pd.DataFrame(rows, columns=[i[0] for i in result.description])

        A           B     C  D
0  Kanpur          UP  3.97  7
1  Jaipur   Rajasthan  4.25  6
2   Surat     Gujarat  3.67  5
3  Mumbai  Maharastra  1.25  4
4  Bhopal          MP  4.76  3

In [55]:
result = conDB.execute("select *from test where B='Gujarat'")
rows = result.fetchall()
rows

[(u'Surat', u'Gujarat', 3.67, 5)]

In [61]:
result = conDB.execute("select *from test where C>=3.97")
rows = result.fetchall()
pd.DataFrame(rows, columns=[i[0] for i in result.description])

        A          B     C  D
0  Jaipur  Rajasthan  4.25  6
1  Kanpur         UP  3.97  7
2  Bhopal         MP  4.76  3

# Creating grades table in my_database.db

In [25]:
conDB.execute("drop table if exists grades")
conDB.execute("create table grades(ID int, Name text, Score int)")
conDB.commit()

In [26]:
# inserting single data row in grades table inside my_database
conDB.execute("insert into grades values(101, 'Alpesh', 90)")
conDB.execute("insert into grades values(102, 'Mahesh', 75)")
conDB.commit()

In [27]:
# inserting multiple data rows in grades table inside my_database.db
data = [(103, 'Ramesh', 80), (104, 'Naresh', 95), (105, 'Haresh', 85)]
query = "insert into grades values(?, ?, ?)"
conDB.executemany(query, data)
conDB.commit()

In [28]:
cur = conDB.execute("select *from grades")
rows = cur.fetchall()
rows

[(101, u'Alpesh', 90),
 (102, u'Mahesh', 75),
 (103, u'Ramesh', 80),
 (104, u'Naresh', 95),
 (105, u'Haresh', 85)]

In [62]:
# Displaying data in normal form
cur = conDB.execute("select *from grades")
rows = cur.fetchall()
rows

[(101, u'Alpesh', 90),
 (102, u'Mahesh', 75),
 (103, u'Ramesh', 80),
 (104, u'Naresh', 95),
 (105, u'Haresh', 85)]

In [63]:
# Displaying data in Tabular format
pd.DataFrame(rows, columns=[x[0] for x in cur.description])

    ID    Name  Score
0  101  Alpesh     90
1  102  Mahesh     75
2  103  Ramesh     80
3  104  Naresh     95
4  105  Haresh     85